notebook/blog-2008-02-16-0721.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Kant's "Logic" &mdash; and an Eon update</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:52 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="Kant's "Logic" --- and an Eon update"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Kant's "Logic" &mdash; and an Eon update</h1>

<p>From the translator's introduction to Immanuel Kant's textbook of
philosophy and logic (first published in 1800 as "Immanuel Kant's
Logic: A Manual for Lectures" and now available in an inexpensive
Dover edition as simply "Logic"):
</p>
<pre class="example">
The time will certainly come in philosophy when the one-sided 
emphasis on symbolic manipulations will be overcome and logic 
will be seen in its totality.
</pre>


<p>
and on the next page: 
</p>
<pre class="example">
The pretensions of modern logic, such as its simplification of
existence into a sign or the extension of a sign into metaphysics,
are foreign to [Kant's logic.]
</pre>


<p>
I mainly bought this book because it supposedly helps you understand
Kant's <i>Critique of Pure Reason</i>, but it looks like it may be a
fascinating read in and of itself. And its notion of logic seems quite
different from what I've been reading elsewhere in Russell,
Wittgenstein, Boole, and so on. I've been looking for a book to
"settle into" and spend some time studying&mdash;perhaps something meant
for students is a good idea.
</p>
<p>
<a href="http://dto.mamalala.org/notebook/eon.html">Eon</a> update: inching toward a 1.0 release. I'm writing a detailed
specification and manual in texinfo.
</p>


</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:52 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
